<pre style="font-size:14px; line-height:1.1; font-weight:bold;">
‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó  ‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó ‚ñà‚ñà‚ñà‚ïó   ‚ñà‚ñà‚ïó‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó  ‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó
‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïó‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïó‚ñà‚ñà‚ñà‚ñà‚ïó  ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïó‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïó‚ñà‚ñà‚ïî‚ïê‚ïê‚ïê‚ïê‚ïù
‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïî‚ïù‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïë‚ñà‚ñà‚ïî‚ñà‚ñà‚ïó ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïë  ‚ñà‚ñà‚ïë‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïë‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó
‚ñà‚ñà‚ïî‚ïê‚ïê‚ïê‚ïù ‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïë‚ñà‚ñà‚ïë‚ïö‚ñà‚ñà‚ïó‚ñà‚ñà‚ïë‚ñà‚ñà‚ïë  ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïë‚ïö‚ïê‚ïê‚ïê‚ïê‚ñà‚ñà‚ïë
‚ñà‚ñà‚ïë     ‚ñà‚ñà‚ïë  ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïë ‚ïö‚ñà‚ñà‚ñà‚ñà‚ïë‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïî‚ïù‚ñà‚ñà‚ïë  ‚ñà‚ñà‚ïë‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïë
‚ïö‚ïê‚ïù     ‚ïö‚ïê‚ïù  ‚ïö‚ïê‚ïù‚ïö‚ïê‚ïù  ‚ïö‚ïê‚ïê‚ïê‚ïù‚ïö‚ïê‚ïê‚ïê‚ïê‚ïê‚ïù ‚ïö‚ïê‚ïù  ‚ïö‚ïê‚ïù‚ïö‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïù

‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó ‚ñà‚ñà‚ïó      ‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó ‚ñà‚ñà‚ïó   ‚ñà‚ñà‚ïó ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó  ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó ‚ñà‚ñà‚ïó   ‚ñà‚ñà‚ïó‚ñà‚ñà‚ñà‚ïó   ‚ñà‚ñà‚ïó‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó 
‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïó‚ñà‚ñà‚ïë     ‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïó‚ïö‚ñà‚ñà‚ïó ‚ñà‚ñà‚ïî‚ïù‚ñà‚ñà‚ïî‚ïê‚ïê‚ïê‚ïê‚ïù ‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïó‚ñà‚ñà‚ïî‚ïê‚ïê‚ïê‚ñà‚ñà‚ïó‚ñà‚ñà‚ïë   ‚ñà‚ñà‚ïë‚ñà‚ñà‚ñà‚ñà‚ïó  ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïó
‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïî‚ïù‚ñà‚ñà‚ïë     ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïë ‚ïö‚ñà‚ñà‚ñà‚ñà‚ïî‚ïù ‚ñà‚ñà‚ïë  ‚ñà‚ñà‚ñà‚ïó‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïî‚ïù‚ñà‚ñà‚ïë   ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïë   ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïî‚ñà‚ñà‚ïó ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïë  ‚ñà‚ñà‚ïë
‚ñà‚ñà‚ïî‚ïê‚ïê‚ïê‚ïù ‚ñà‚ñà‚ïë     ‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïë  ‚ïö‚ñà‚ñà‚ïî‚ïù  ‚ñà‚ñà‚ïë   ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïî‚ïê‚ïê‚ñà‚ñà‚ïó‚ñà‚ñà‚ïë   ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïë   ‚ñà‚ñà‚ïë‚ñà‚ñà‚ïë‚ïö‚ñà‚ñà‚ïó‚ñà‚ñà‚ïë‚ñà‚ñà‚ïë  ‚ñà‚ñà‚ïë
‚ñà‚ñà‚ïë     ‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïó‚ñà‚ñà‚ïë  ‚ñà‚ñà‚ïë   ‚ñà‚ñà‚ïë   ‚ïö‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïî‚ïù‚ñà‚ñà‚ïë  ‚ñà‚ñà‚ïë‚ïö‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïî‚ïù‚ïö‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïî‚ïù‚ñà‚ñà‚ïë ‚ïö‚ñà‚ñà‚ñà‚ñà‚ïë‚ñà‚ñà‚ñà‚ñà‚ñà‚ñà‚ïî‚ïù
‚ïö‚ïê‚ïù     ‚ïö‚ïê‚ïê‚ïê‚ïê‚ïê‚ïê‚ïù‚ïö‚ïê‚ïù  ‚ïö‚ïê‚ïù   ‚ïö‚ïê‚ïù    ‚ïö‚ïê‚ïê‚ïê‚ïê‚ïê‚ïù ‚ïö‚ïê‚ïù  ‚ïö‚ïê‚ïù ‚ïö‚ïê‚ïê‚ïê‚ïê‚ïê‚ïù  ‚ïö‚ïê‚ïê‚ïê‚ïê‚ïê‚ïù ‚ïö‚ïê‚ïù  ‚ïö‚ïê‚ïê‚ïê‚ïù‚ïö‚ïê‚ïê‚ïê‚ïê‚ïê‚ïù 
</pre>

üëã **Welcome to _Pandas Playground_**  

This notebook is my **hands-on playground** for mastering **pandas**,  
the most powerful library for **data manipulation and analysis** in Python.

Here, I will:
- üêº Build **strong pandas fundamentals**
- üìä Work with **real-world datasets**
- üßπ Clean, transform, and analyze data efficiently
- ‚ö° Write **readable, idiomatic, and performant pandas code**

---

## üéØ Mission
To **master pandas deeply**, beyond just `.head()` and `.groupby()` ‚Äî  
and to document my learning with clarity and purpose.

---

## üöÄ What You‚Äôll Find Inside
- üìå DataFrames & Series (from basics to advanced)
- üìå Indexing, filtering, and transformations
- üìå Data cleaning & preprocessing techniques
- üìå Practical patterns used in **Data Science & Analytics**

---

## üí°üêº Why *Pandas Playground*?
Because pandas is best learned by **playing with data** ‚Äî  
breaking it, fixing it, and understanding it deeply üß†üêº

---

## ü§ù Let‚Äôs Learn Together
If this notebook helps you, inspires you, or teaches you something new ‚Äî  
feel free to **connect, share, and grow together**.

---

### ‚úçÔ∏è Created & Maintained by  
## **Babar Ali Mahar**

üîó *Sharing my data journey ‚Äî one notebook at a time.*

---

> üìà *‚ÄúIn pandas, clarity beats cleverness.  
> Clean data, clean thinking.‚Äù*

##  What is Pandas and Why Use It?
Pandas is a powerful **Python library** for data analysis and manipulation.

Key points:
- Provides two main data structures: **Series** (1D) and **DataFrame** (2D).
- Makes working with tabular data easy and fast.
- Ideal for cleaning, transforming, and analyzing datasets.
- Works well with other libraries like NumPy, Matplotlib, and Scikit-Learn.

##  Installing & Importing Pandas
To install pandas, open your terminal or command prompt and run:
```bash
pip install pandas
```
Then, you can import it in Python as follows:

In [1]:
import numpy as np 
import pandas as pd

##  Understanding Series & DataFrame
- **Series**: One-dimensional labeled array, like a column in Excel.
- **DataFrame**: Two-dimensional table, similar to an Excel sheet or SQL table.

### Creating a Series from Python Lists or Dictionaries

In [2]:
a = [10,20,30,40]
s= pd.Series(a,name = "Marks")
s

d = {"Babar": 23,
     "Ali": 20,
     "Sohail": 40
     }
s2 = pd.Series(d)
s2

Babar     23
Ali       20
Sohail    40
dtype: int64

### Creating a DataFrame

In [3]:
a = {
    "Name": ["Babar","Ali", "Sohail", "Ghulam", "Akram"],
    "Marks": [10,20,30,40,50],
    "Subject": ["Math", "Urdu", "Science", "Chem","Physics"]
}


pd.DataFrame(a)

     Name  Marks  Subject
0   Babar     10     Math
1     Ali     20     Urdu
2  Sohail     30  Science
3  Ghulam     40     Chem
4   Akram     50  Physics

### Creating DataFrame from NumPy Arrays

In [4]:
a = np.array([[1,2,3],
              [4,5,6],
              [7,8,9]])
df= pd.DataFrame(a, columns=["A", "B", "D"]) # Customize the name of columns
df

   A  B  D
0  1  2  3
1  4  5  6
2  7  8  9

## Inspecting Data
Quick ways to understand your dataset:
- `head(n)` ‚Üí first *n* rows (default 5)
- `tail(n)` ‚Üí last *n* rows
- `info()` ‚Üí columns, non-null counts, and dtypes
- `shape` ‚Üí (rows, columns)
- `dtypes` ‚Üí data type of each column

In [5]:
import pandas as pd

a = {
    "Name": [
        "Babar", "Ali", "Sohail", "Ghulam", "Akram",
        "Ahmed", "Usman", "Hassan", "Bilal", "Adeel"
    ],
    "Marks": [
        10, 20, 30, 40, 50,
        60, 70, 80, 90, 85
    ],
    "Subject": [
        "Math", "Urdu", "Science", "Chemistry", "Physics",
        "Biology", "English", "Computer", "Statistics", "Economics"
    ]
}

df = pd.DataFrame(a)
df

     Name  Marks     Subject
0   Babar     10        Math
1     Ali     20        Urdu
2  Sohail     30     Science
3  Ghulam     40   Chemistry
4   Akram     50     Physics
5   Ahmed     60     Biology
6   Usman     70     English
7  Hassan     80    Computer
8   Bilal     90  Statistics
9   Adeel     85   Economics

In [6]:
df.head(7)

     Name  Marks    Subject
0   Babar     10       Math
1     Ali     20       Urdu
2  Sohail     30    Science
3  Ghulam     40  Chemistry
4   Akram     50    Physics
5   Ahmed     60    Biology
6   Usman     70    English

In [7]:
df.tail(7)

     Name  Marks     Subject
3  Ghulam     40   Chemistry
4   Akram     50     Physics
5   Ahmed     60     Biology
6   Usman     70     English
7  Hassan     80    Computer
8   Bilal     90  Statistics
9   Adeel     85   Economics

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     10 non-null     object
 1   Marks    10 non-null     int64
 2   Subject  10 non-null     object
dtypes: int64(1), object(2)
memory usage: 372.0+ bytes

In [9]:
df.shape #no braces with shape because it's attributes

(10, 3)

In [10]:
df.dtypes

Name       object
Marks       int64
Subject    object
dtype: object

##  Selecting Columns & Rows
Ways to access parts of a DataFrame:
- Single column ‚Üí `df['col']`
- Multiple columns ‚Üí `df[['col1','col2']]`
- Label-based selection ‚Üí `df.loc[row_label, col_label]`
- Integer-index selection ‚Üí `df.iloc[row_idx, col_idx]`
Tip: `:` means "all rows/columns" in that dimension.

In [11]:
df['Marks'] # Single Column

0    10
1    20
2    30
3    40
4    50
5    60
6    70
7    80
8    90
9    85
Name: Marks, dtype: int64

In [12]:
df[["Name", "Marks"]] # Multiple Columns

     Name  Marks
0   Babar     10
1     Ali     20
2  Sohail     30
3  Ghulam     40
4   Akram     50
5   Ahmed     60
6   Usman     70
7  Hassan     80
8   Bilal     90
9   Adeel     85

In [13]:
df.loc[1:5, ["Name","Marks"]] #Label-Based-Selection

     Name  Marks
1     Ali     20
2  Sohail     30
3  Ghulam     40
4   Akram     50
5   Ahmed     60

In [14]:
df.iloc[8]  #integer-Indexed-Selection

Name            Bilal
Marks              90
Subject    Statistics
Name: 8, dtype: object

##  Index & Columns Overview
- `df.index` ‚Üí row labels
- `df.columns` ‚Üí column names
- `df.values` ‚Üí underlying NumPy array (read-only; prefer using DataFrame ops)

In [15]:
df.index

RangeIndex(start=0, stop=10, step=1)

In [16]:
df.columns

Index(['Name', 'Marks', 'Subject'], dtype='object')

In [17]:
df.values

array([['Babar', 10, 'Math'],
       ['Ali', 20, 'Urdu'],
       ['Sohail', 30, 'Science'],
       ['Ghulam', 40, 'Chemistry'],
       ['Akram', 50, 'Physics'],
       ['Ahmed', 60, 'Biology'],
       ['Usman', 70, 'English'],
       ['Hassan', 80, 'Computer'],
       ['Bilal', 90, 'Statistics'],
       ['Adeel', 85, 'Economics']], dtype=object)

##  Renaming Columns & Setting an Index
- Rename columns ‚Üí `df.rename(columns={'old':'new'}, inplace=False)`
- Set a column as index ‚Üí `df.set_index('column_name', inplace=False)`
- Reset index ‚Üí `df.reset_index(inplace=False)`
 If you don't use `inplace=True`, remember to assign the result back to a variable.

In [18]:
data = df.rename(columns={"Marks": "Score"},inplace=True)
data

In [19]:
# df.set_index("Name", inplace= True)

In [20]:
df

     Name  Score     Subject
0   Babar     10        Math
1     Ali     20        Urdu
2  Sohail     30     Science
3  Ghulam     40   Chemistry
4   Akram     50     Physics
5   Ahmed     60     Biology
6   Usman     70     English
7  Hassan     80    Computer
8   Bilal     90  Statistics
9   Adeel     85   Economics

In [21]:
# df.reset_index("Name", inplace= True)

In [22]:
df

     Name  Score     Subject
0   Babar     10        Math
1     Ali     20        Urdu
2  Sohail     30     Science
3  Ghulam     40   Chemistry
4   Akram     50     Physics
5   Ahmed     60     Biology
6   Usman     70     English
7  Hassan     80    Computer
8   Bilal     90  Statistics
9   Adeel     85   Economics

## Handling Missing Values
Real-world datasets often have missing data. Pandas offers:
- `isna()` / `isnull()` ‚Üí detect missing values (returns True/False)
- `dropna()` ‚Üí remove missing values (rows/columns)
- `fillna()` ‚Üí replace missing values with a given value or method (e.g., forward fill)

Always inspect how much data is missing before deciding to drop or fill.

In [23]:
data = {
    "Name": [
        "Babar", "Ali", "Sohail", "Ghulam", "Akram",
        "Ahmed", "Usman", "Hassan", "Bilal", "Adeel"
    ],
    "Age": [
        22, 25, np.nan, 30, 28,
        np.nan, 24, 27, 26, np.nan
    ],
    "City": [
        "Karachi", "Lahore", "Karachi", np.nan, "Islamabad",
        "Lahore", np.nan, "Peshawar", "Quetta", "Karachi"
    ],
    "Score": [
        85, np.nan, 78, 92, np.nan,
        88, 75, np.nan, 90, 82
    ]
}

df2 = pd.DataFrame(data)
df2

     Name   Age       City  Score
0   Babar  22.0    Karachi   85.0
1     Ali  25.0     Lahore    NaN
2  Sohail   NaN    Karachi   78.0
3  Ghulam  30.0        NaN   92.0
4   Akram  28.0  Islamabad    NaN
5   Ahmed   NaN     Lahore   88.0
6   Usman  24.0        NaN   75.0
7  Hassan  27.0   Peshawar    NaN
8   Bilal  26.0     Quetta   90.0
9   Adeel   NaN    Karachi   82.0

In [24]:
df2.isnull()

    Name    Age   City  Score
0  False  False  False  False
1  False  False  False   True
2  False   True  False  False
3  False  False   True  False
4  False  False  False   True
5  False   True  False  False
6  False  False   True  False
7  False  False  False   True
8  False  False  False  False
9  False   True  False  False

In [25]:
df2.isnull().sum()

Name     0
Age      3
City     2
Score    3
dtype: int64

In [26]:
df2.dropna()

    Name   Age     City  Score
0  Babar  22.0  Karachi   85.0
8  Bilal  26.0   Quetta   90.0

In [27]:
df2['Age'] = df2['Age'].fillna(df2['Age'].mean())
df2['City'] = df2['City'].fillna(df2['City'].mode())
df2['Score'] = df2['Score'].fillna(df2['Score'].mode())
df2

     Name   Age       City  Score
0   Babar  22.0    Karachi   85.0
1     Ali  25.0     Lahore   78.0
2  Sohail  26.0    Karachi   78.0
3  Ghulam  30.0        NaN   92.0
4   Akram  28.0  Islamabad   88.0
5   Ahmed  26.0     Lahore   88.0
6   Usman  24.0        NaN   75.0
7  Hassan  27.0   Peshawar    NaN
8   Bilal  26.0     Quetta   90.0
9   Adeel  26.0    Karachi   82.0

## Changing Data Types (`astype`)
- Convert a column to a different type using `astype()`.
- Examples: converting strings to numbers, integers to floats, or columns to category.

Be careful: make sure the data is compatible with the new type!

In [28]:
a = {
    "Name": ["Babar","Ali", "Sohail", "Ghulam", "Akram"],
    "Score": [10,20,30,40,50],
    "Subject": ["Math", "Urdu", "Science", "Chem","Physics"]
}


b= pd.DataFrame(a)
b

     Name  Score  Subject
0   Babar     10     Math
1     Ali     20     Urdu
2  Sohail     30  Science
3  Ghulam     40     Chem
4   Akram     50  Physics

In [29]:
b['Score'] = b['Score'].astype(float)
b

     Name  Score  Subject
0   Babar   10.0     Math
1     Ali   20.0     Urdu
2  Sohail   30.0  Science
3  Ghulam   40.0     Chem
4   Akram   50.0  Physics

## Replacing Values (`replace`)
- Use `replace()` to substitute specific values or patterns.
- Useful for cleaning labels, fixing typos, or mapping categories.

In [30]:
c  = b.copy()

In [31]:
c['Name'] = c['Name'].replace("Sohail","Mahar")
c

     Name  Score  Subject
0   Babar   10.0     Math
1     Ali   20.0     Urdu
2   Mahar   30.0  Science
3  Ghulam   40.0     Chem
4   Akram   50.0  Physics

In [32]:
c['Score']  = c["Score"].replace({10.0:15.0, 40.0:45.0})
c

     Name  Score  Subject
0   Babar   15.0     Math
1     Ali   20.0     Urdu
2   Mahar   30.0  Science
3  Ghulam   45.0     Chem
4   Akram   50.0  Physics

## Dropping Rows & Columns (`drop`)
- `drop(labels, axis=0)` ‚Üí drop rows by index labels.
- `drop(labels, axis=1)` ‚Üí drop columns by name.
- Use `inplace=True` if you want to modify the DataFrame directly.

In [33]:
c.drop(['Name'],axis=1) #shadow copy

   Score  Subject
0   15.0     Math
1   20.0     Urdu
2   30.0  Science
3   45.0     Chem
4   50.0  Physics

## Detecting & Removing Duplicates
- `duplicated()` ‚Üí returns a Boolean Series marking duplicate rows.
- `drop_duplicates()` ‚Üí remove duplicate rows.
- You can specify `subset` (columns) and `keep` ('first', 'last', or False).

In [34]:
df.duplicated()
# df.drop_duplicates(inplace= True)

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

##  Boolean Indexing & Conditional Selection
- Use comparison operators to build conditions (e.g., `df['col'] > 50`).
- Pass the condition inside `df[...]` to get matching rows.
- Combine multiple conditions with `&` (AND), `|` (OR), and `~` (NOT).
- Parentheses are required when combining conditions.

In [35]:
data = {
    "Name": [
        "Babar", "Ali", "Sohail", "Ghulam", "Akram",
        "Ali", "Hassan", "Bilal", "Usman", "Babar"
    ],
    "Age": [
        22, 25, 28, 30, 28,
        25, 27, np.nan, 24, 22
    ],
    "Score": [
        85, 88, 78, 92, 88,
        88, 75, 90, np.nan, 85
    ]
}

df3 = pd.DataFrame(data)
df3

     Name   Age  Score
0   Babar  22.0   85.0
1     Ali  25.0   88.0
2  Sohail  28.0   78.0
3  Ghulam  30.0   92.0
4   Akram  28.0   88.0
5     Ali  25.0   88.0
6  Hassan  27.0   75.0
7   Bilal   NaN   90.0
8   Usman  24.0    NaN
9   Babar  22.0   85.0

In [36]:
df3[df3['Age'] < 25]

    Name   Age  Score
0  Babar  22.0   85.0
8  Usman  24.0    NaN
9  Babar  22.0   85.0

In [37]:
df3[(df3["Age"] > 25) & (df3["Score"] > 35)]

     Name   Age  Score
2  Sohail  28.0   78.0
3  Ghulam  30.0   92.0
4   Akram  28.0   88.0
6  Hassan  27.0   75.0

In [38]:
df3[(df3["Score"] < 25 ) | (df3["Score"] > 85)]

     Name   Age  Score
1     Ali  25.0   88.0
3  Ghulam  30.0   92.0
4   Akram  28.0   88.0
5     Ali  25.0   88.0
7   Bilal   NaN   90.0

In [39]:
# Not `~`
df3[~(df3["Score"] > 85)]

     Name   Age  Score
0   Babar  22.0   85.0
2  Sohail  28.0   78.0
6  Hassan  27.0   75.0
8   Usman  24.0    NaN
9   Babar  22.0   85.0

## Filtering Rows with Multiple Conditions
- Combine two or more conditions to refine selection.
- Remember to enclose each condition in parentheses.

In [40]:
df3[(df3["Age"] > 25) & (df3["Score"] > 35)]

     Name   Age  Score
2  Sohail  28.0   78.0
3  Ghulam  30.0   92.0
4   Akram  28.0   88.0
6  Hassan  27.0   75.0

##  Using `query()` for Cleaner Filtering
- `query()` allows filtering rows with a string expression.
- It's concise and readable for complex conditions.
- Variables can be passed using the `@` symbol.

In [41]:
# Simple query: Age> 25
df3.query("Age > 25")

     Name   Age  Score
2  Sohail  28.0   78.0
3  Ghulam  30.0   92.0
4   Akram  28.0   88.0
6  Hassan  27.0   75.0

In [42]:
# Multiple Conditions: Age < 35 and Score >= 85
df3.query("Age < 35 and Score >= 85")

     Name   Age  Score
0   Babar  22.0   85.0
1     Ali  25.0   88.0
3  Ghulam  30.0   92.0
4   Akram  28.0   88.0
5     Ali  25.0   88.0
9   Babar  22.0   85.0

In [43]:
hold = 90
df3.query("Score > @hold")

     Name   Age  Score
3  Ghulam  30.0   92.0

In [44]:
df3['Name'].str.lower()

0     babar
1       ali
2    sohail
3    ghulam
4     akram
5       ali
6    hassan
7     bilal
8     usman
9     babar
Name: Name, dtype: object

In [45]:
df3['Name'].str.contains("a")

0     True
1    False
2     True
3     True
4     True
5    False
6     True
7     True
8     True
9     True
Name: Name, dtype: bool

In [46]:
df3["Name"].str.replace("Ali", "Mahar")

0     Babar
1     Mahar
2    Sohail
3    Ghulam
4     Akram
5     Mahar
6    Hassan
7     Bilal
8     Usman
9     Babar
Name: Name, dtype: object

## 1. Sorting Data
- Use `sort_values(by='col')` to sort by column values.
- Use `ascending=False` for descending order.
- Sort by multiple columns by passing a list.
- `sort_index()` sorts by row or column index.

In [47]:
d = {
    "Product": [
        "Laptop", "Mobile", "Tablet", "Headphones", "Monitor",
        "Keyboard", "Mouse", "Laptop", "Speaker", "Mobile"
    ],
    "Price": [
        1200, 800, 450, 150, 300,
        100, 50, 1200, np.nan, 800
    ],
    "Stock": [
        10, 25, 15, 40, 20,
        50, 60, 10, 30, np.nan
    ],
    "Rating": [
        4.5, 4.3, 4.0, 4.1, 4.2,
        3.9, 4.0, 4.5, 4.4, 4.3
    ]
}

df4 = pd.DataFrame(d)
df4

      Product   Price  Stock  Rating
0      Laptop  1200.0   10.0     4.5
1      Mobile   800.0   25.0     4.3
2      Tablet   450.0   15.0     4.0
3  Headphones   150.0   40.0     4.1
4     Monitor   300.0   20.0     4.2
5    Keyboard   100.0   50.0     3.9
6       Mouse    50.0   60.0     4.0
7      Laptop  1200.0   10.0     4.5
8     Speaker     NaN   30.0     4.4
9      Mobile   800.0    NaN     4.3

In [48]:
df4.sort_values(by = "Price", ascending= True)

      Product   Price  Stock  Rating
6       Mouse    50.0   60.0     4.0
5    Keyboard   100.0   50.0     3.9
3  Headphones   150.0   40.0     4.1
4     Monitor   300.0   20.0     4.2
2      Tablet   450.0   15.0     4.0
1      Mobile   800.0   25.0     4.3
9      Mobile   800.0    NaN     4.3
0      Laptop  1200.0   10.0     4.5
7      Laptop  1200.0   10.0     4.5
8     Speaker     NaN   30.0     4.4

In [49]:
df4.sort_values(by = ["Price", "Stock"], ascending= [True, False])

      Product   Price  Stock  Rating
6       Mouse    50.0   60.0     4.0
5    Keyboard   100.0   50.0     3.9
3  Headphones   150.0   40.0     4.1
4     Monitor   300.0   20.0     4.2
2      Tablet   450.0   15.0     4.0
1      Mobile   800.0   25.0     4.3
9      Mobile   800.0    NaN     4.3
0      Laptop  1200.0   10.0     4.5
7      Laptop  1200.0   10.0     4.5
8     Speaker     NaN   30.0     4.4

## 2. Descriptive Statistics
- `mean()`, `median()`, `mode()` for central tendency.
- `std()` for standard deviation.
- `describe()` for a summary of stats (count, mean, std, min, quartiles, max).

In [50]:
df4.mean(numeric_only= True)

Price     561.111111
Stock      28.888889
Rating      4.220000
dtype: float64

In [51]:
df4.median(numeric_only= True)

Price     450.00
Stock      25.00
Rating      4.25
dtype: float64

In [52]:
df.describe()

          Score
count  10.00000
mean   53.50000
std    28.09211
min    10.00000
25%    32.50000
50%    55.00000
75%    77.50000
max    90.00000

## 3. Counting Values
- `value_counts()` shows the frequency of unique values in a Series.
- Use `normalize=True` to see percentages instead of counts.

In [53]:
df4["Product"].value_counts(normalize= True)

Product
Laptop        0.2
Mobile        0.2
Tablet        0.1
Headphones    0.1
Monitor       0.1
Keyboard      0.1
Mouse         0.1
Speaker       0.1
Name: proportion, dtype: float64

## 4. Correlation & Covariance
- `corr()` computes correlation between numeric columns.
- `cov()` computes covariance.
- Correlation values range from -1 (negative) to +1 (positive).

In [54]:
df4.corr(numeric_only= True)

           Price     Stock    Rating
Price   1.000000 -0.809881  0.927134
Stock  -0.809881  1.000000 -0.694877
Rating  0.927134 -0.694877  1.000000

In [55]:
df4.cov(numeric_only= True)

                Price        Stock     Rating
Price   206736.111111 -7348.214286  91.875000
Stock    -7348.214286   317.361111  -2.798611
Rating      91.875000    -2.798611   0.046222

In [56]:
df4['Price'].corr(df4['Rating'])

np.float64(0.9271337184660171)

##  Concept of Split‚ÄìApply‚ÄìCombine
- **Split** the data into groups based on some criteria.
- **Apply** a function (e.g., sum, mean) to each group.
- **Combine** the results into a new DataFrame or Series.

This is the core idea behind `groupby`.

In [57]:
e = {
    "Employee": [
        "Babar", "Ali", "Sohail", "Ghulam", "Akram",
        "Ali", "Hassan", "Bilal", "Usman", "Babar"
    ],
    "Department": [
        "IT", "HR", "Finance", "IT", "Finance",
        "HR", "IT", "Sales", "Sales", "Finance"
    ],
    "Salary": [
        70000, 60000, 65000, 72000, 68000,
        60000, 71000, np.nan, 55000, np.nan
    ]
}

dat = pd.DataFrame(e)
dat

  Employee Department   Salary
0    Babar         IT  70000.0
1      Ali         HR  60000.0
2   Sohail    Finance  65000.0
3   Ghulam         IT  72000.0
4    Akram    Finance  68000.0
5      Ali         HR  60000.0
6   Hassan         IT  71000.0
7    Bilal      Sales      NaN
8    Usman      Sales  55000.0
9    Babar    Finance      NaN

In [58]:
dat['Department'].value_counts()

Department
IT         3
Finance    3
HR         2
Sales      2
Name: count, dtype: int64

In [59]:
dat[dat['Department'] == "IT"]["Salary"]

0    70000.0
3    72000.0
6    71000.0
Name: Salary, dtype: float64

In [60]:
dat[dat['Department'] == "IT"]["Salary"].mean()

np.float64(71000.0)

In [61]:
dat.groupby("Department")["Salary"].mean() #Shortcut Way

Department
Finance    66500.0
HR         60000.0
IT         71000.0
Sales      55000.0
Name: Salary, dtype: float64

In [62]:
dat.groupby('Department')["Employee"].sum()

Department
Finance     SohailAkramBabar
HR                    AliAli
IT         BabarGhulamHassan
Sales             BilalUsman
Name: Employee, dtype: object

##  Using `groupby()` with Aggregation Functions
- Use `groupby('col').mean()` or other functions like sum, count, min, max.
- You can also use `agg()` to pass multiple functions at once.

In [63]:
dat.groupby("Department")["Salary"].agg(["mean","max","min"])

               mean      max      min
Department
Finance     66500.0  68000.0  65000.0
HR          60000.0  60000.0  60000.0
IT          71000.0  72000.0  70000.0
Sales       55000.0  55000.0  55000.0

##  Multiple Aggregations on Different Columns
- With `agg()`, you can specify different functions for each column.
- Example: `df.groupby('Dept').agg({'Salary':'mean', 'Age':'max'})`.

In [64]:
df4

      Product   Price  Stock  Rating
0      Laptop  1200.0   10.0     4.5
1      Mobile   800.0   25.0     4.3
2      Tablet   450.0   15.0     4.0
3  Headphones   150.0   40.0     4.1
4     Monitor   300.0   20.0     4.2
5    Keyboard   100.0   50.0     3.9
6       Mouse    50.0   60.0     4.0
7      Laptop  1200.0   10.0     4.5
8     Speaker     NaN   30.0     4.4
9      Mobile   800.0    NaN     4.3

In [65]:
df4.groupby("Product").agg({
    "Price":["mean", "max", "min"],
    "Stock":["mean", "max", "min"],
    "Rating":["mean","max", "min"]
})

             Price                 Stock             Rating
              mean     max     min  mean   max   min   mean  max  min
Product
Headphones   150.0   150.0   150.0  40.0  40.0  40.0    4.1  4.1  4.1
Keyboard     100.0   100.0   100.0  50.0  50.0  50.0    3.9  3.9  3.9
Laptop      1200.0  1200.0  1200.0  10.0  10.0  10.0    4.5  4.5  4.5
Mobile       800.0   800.0   800.0  25.0  25.0  25.0    4.3  4.3  4.3
Monitor      300.0   300.0   300.0  20.0  20.0  20.0    4.2  4.2  4.2
Mouse         50.0    50.0    50.0  60.0  60.0  60.0    4.0  4.0  4.0
Speaker        NaN     NaN     NaN  30.0  30.0  30.0    4.4  4.4  4.4
Tablet       450.0   450.0   450.0  15.0  15.0  15.0    4.0  4.0  4.0

##  Pivot Tables & Crosstab
- `pivot_table()` summarizes data like Excel pivot tables.
- `crosstab()` shows frequency counts of combinations of factors.
- Both are powerful for summarizing and comparing groups.

In [66]:
dat.pivot_table(values= "Salary", index= "Department", aggfunc="mean")

             Salary
Department
Finance     66500.0
HR          60000.0
IT          71000.0
Sales       55000.0

In [67]:
df3

     Name   Age  Score
0   Babar  22.0   85.0
1     Ali  25.0   88.0
2  Sohail  28.0   78.0
3  Ghulam  30.0   92.0
4   Akram  28.0   88.0
5     Ali  25.0   88.0
6  Hassan  27.0   75.0
7   Bilal   NaN   90.0
8   Usman  24.0    NaN
9   Babar  22.0   85.0

In [68]:
df3["AgeGroup"]= pd.cut(df3["Age"], bins = [20,30,35,40], labels = ['25-30','31-35','36-40'])

In [69]:
df3

     Name   Age  Score AgeGroup
0   Babar  22.0   85.0    25-30
1     Ali  25.0   88.0    25-30
2  Sohail  28.0   78.0    25-30
3  Ghulam  30.0   92.0    25-30
4   Akram  28.0   88.0    25-30
5     Ali  25.0   88.0    25-30
6  Hassan  27.0   75.0    25-30
7   Bilal   NaN   90.0      NaN
8   Usman  24.0    NaN    25-30
9   Babar  22.0   85.0    25-30

In [70]:
pd.crosstab(df3["Name"], df3["AgeGroup"])

AgeGroup  25-30
Name
Akram         1
Ali           2
Babar         2
Ghulam        1
Hassan        1
Sohail        1
Usman         1

## Using `concat()` for Stacking Data
- `pd.concat()` combines DataFrames vertically (rows) or horizontally (columns).
- Use `axis=0` for vertical stacking (default), `axis=1` for horizontal.
- `ignore_index=True` can reset the index after concatenation.

In [71]:
data = {
    "ProductID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "ProductName": [
        "Laptop", "Mobile", "Tablet", "Headphones", "Monitor",
        "Keyboard", "Mouse", "Speaker", "Charger", "Smartwatch"
    ],
    "Price": [1200, 800, 450, 150, 300, 100, 50, 150, 50, 300]
}

df5 = pd.DataFrame(data)


data2 = {
    "ProductID": [201, 202, 203, 204, 205, 206, 207, 208, 209, 210],
    "ProductName": [
        "Printer", "Router", "SSD", "Hard Drive", "Power Bank",
        "USB Cable", "Webcam", "Microphone", "Projector", "AirPods"
    ],
    "Price": [250, 120, 180, 200, 150, 25, 90, 110, 500, 180]
}

df6 = pd.DataFrame(data2)

In [72]:
df5, df6

(   ProductID ProductName  Price
 0        101      Laptop   1200
 1        102      Mobile    800
 2        103      Tablet    450
 3        104  Headphones    150
 4        105     Monitor    300
 5        106    Keyboard    100
 6        107       Mouse     50
 7        108     Speaker    150
 8        109     Charger     50
 9        110  Smartwatch    300,
    ProductID ProductName  Price
 0        201     Printer    250
 1        202      Router    120
 2        203         SSD    180
 3        204  Hard Drive    200
 4        205  Power Bank    150
 5        206   USB Cable     25
 6        207      Webcam     90
 7        208  Microphone    110
 8        209   Projector    500
 9        210     AirPods    180)

In [73]:
pd.concat([df5,df6], ignore_index= True)

    ProductID ProductName  Price
0         101      Laptop   1200
1         102      Mobile    800
2         103      Tablet    450
3         104  Headphones    150
4         105     Monitor    300
5         106    Keyboard    100
6         107       Mouse     50
7         108     Speaker    150
8         109     Charger     50
9         110  Smartwatch    300
10        201     Printer    250
11        202      Router    120
12        203         SSD    180
13        204  Hard Drive    200
14        205  Power Bank    150
15        206   USB Cable     25
16        207      Webcam     90
17        208  Microphone    110
18        209   Projector    500
19        210     AirPods    180

##  Using `merge()` for SQL-Style Joins
- `merge()` is similar to SQL joins.
- Specify `on` or `left_on`/`right_on` to choose key columns.
- Join types: `inner` (default), `left`, `right`, `outer`.

In [74]:
products = pd.concat([df5,df6], ignore_index= True)
products

    ProductID ProductName  Price
0         101      Laptop   1200
1         102      Mobile    800
2         103      Tablet    450
3         104  Headphones    150
4         105     Monitor    300
5         106    Keyboard    100
6         107       Mouse     50
7         108     Speaker    150
8         109     Charger     50
9         110  Smartwatch    300
10        201     Printer    250
11        202      Router    120
12        203         SSD    180
13        204  Hard Drive    200
14        205  Power Bank    150
15        206   USB Cable     25
16        207      Webcam     90
17        208  Microphone    110
18        209   Projector    500
19        210     AirPods    180

In [75]:
sales_data =pd.DataFrame( {
    "ProductID": [101, 102, 103, 104, 105, 101, 102, 108, 109, 110], # 106 Doesn't exist in Products
    "UnitsSold": [5, 12, 7, 20, 9, 8, 15, 6, 10, 4]
})

sales_df = pd.DataFrame(sales_data)
sales_df

   ProductID  UnitsSold
0        101          5
1        102         12
2        103          7
3        104         20
4        105          9
5        101          8
6        102         15
7        108          6
8        109         10
9        110          4

In [76]:
pd.merge(products, sales_data, on= "ProductID")

   ProductID ProductName  Price  UnitsSold
0        101      Laptop   1200          5
1        101      Laptop   1200          8
2        102      Mobile    800         12
3        102      Mobile    800         15
4        103      Tablet    450          7
5        104  Headphones    150         20
6        105     Monitor    300          9
7        108     Speaker    150          6
8        109     Charger     50         10
9        110  Smartwatch    300          4

In [77]:
pd.merge(products, sales_data, how= "right")

   ProductID ProductName  Price  UnitsSold
0        101      Laptop   1200          5
1        102      Mobile    800         12
2        103      Tablet    450          7
3        104  Headphones    150         20
4        105     Monitor    300          9
5        101      Laptop   1200          8
6        102      Mobile    800         15
7        108     Speaker    150          6
8        109     Charger     50         10
9        110  Smartwatch    300          4

In [78]:
pd.merge(products, sales_data, how = "outer")

    ProductID ProductName  Price  UnitsSold
0         101      Laptop   1200        5.0
1         101      Laptop   1200        8.0
2         102      Mobile    800       12.0
3         102      Mobile    800       15.0
4         103      Tablet    450        7.0
5         104  Headphones    150       20.0
6         105     Monitor    300        9.0
7         106    Keyboard    100        NaN
8         107       Mouse     50        NaN
9         108     Speaker    150        6.0
10        109     Charger     50       10.0
11        110  Smartwatch    300        4.0
12        201     Printer    250        NaN
13        202      Router    120        NaN
14        203         SSD    180        NaN
15        204  Hard Drive    200        NaN
16        205  Power Bank    150        NaN
17        206   USB Cable     25        NaN
18        207      Webcam     90        NaN
19        208  Microphone    110        NaN
20        209   Projector    500        NaN
21        210     AirPods    180        NaN

##  Using `join()` with Index Alignment
- `join()` joins DataFrames on their index or on a key column.
- By default, joins on index; can specify `on='col'`.
- Useful for adding columns to an existing DataFrame.

In [79]:
stock = pd.DataFrame({
    "Stock":[100,60,80,120,150],

}, index = [101,102,103,104,105])

In [80]:
p_dataset = products.set_index("ProductID")

In [81]:
p_dataset.join(stock)

          ProductName  Price  Stock
ProductID
101            Laptop   1200  100.0
102            Mobile    800   60.0
103            Tablet    450   80.0
104        Headphones    150  120.0
105           Monitor    300  150.0
106          Keyboard    100    NaN
107             Mouse     50    NaN
108           Speaker    150    NaN
109           Charger     50    NaN
110        Smartwatch    300    NaN
201           Printer    250    NaN
202            Router    120    NaN
203               SSD    180    NaN
204        Hard Drive    200    NaN
205        Power Bank    150    NaN
206         USB Cable     25    NaN
207            Webcam     90    NaN
208        Microphone    110    NaN
209         Projector    500    NaN
210           AirPods    180    NaN

##  Converting Columns to Datetime (`pd.to_datetime`)
- Use `pd.to_datetime()` to convert strings or numbers into datetime objects.
- Once converted, Pandas recognizes them as dates, enabling powerful operations.

In [82]:
orders = {
    "OrderID": [101, 102, 103, 104, 105, 106, 107, 108, 109, 110],
    "OrderDate": [
        "2024-01-05", "2024-01-06", "2024-01-07", "2024-01-08", "2024-01-09",
        "2024-01-10", "2024-01-11", "2024-01-12", "2024-01-13", "2024-01-14"
    ],
    "Customer": [
        "Ali", "Ayesha", "Babar", "Zainab", "Usman",
        "Hina", "Ahmed", "Sara", "Hamza", "Noor"
    ],
    "Amount": [2500, 1800, 3200, 1500, 4000, 2200, 3100, 2700, 2900, 3600]
}

df = pd.DataFrame(orders)
df.dtypes

OrderID       int64
OrderDate    object
Customer     object
Amount        int64
dtype: object

In [83]:
pd.to_datetime(df["OrderDate"])

0   2024-01-05
1   2024-01-06
2   2024-01-07
3   2024-01-08
4   2024-01-09
5   2024-01-10
6   2024-01-11
7   2024-01-12
8   2024-01-13
9   2024-01-14
Name: OrderDate, dtype: datetime64[ns]

## Setting DateTime Index & Resampling
- Set a datetime column as the index with `set_index()`.
- Resample time series using `resample('M').mean()` or other rules ('D', 'W', 'Y').
- Useful for aggregating data by time periods.

In [87]:
df_idx=df.set_index("OrderDate")

##  Applying Custom Functions with `apply()` / `map()`
- `apply()` lets you apply a custom function across rows or columns.
- `map()` is for applying functions element-wise to a Series.
- Both are handy for transformations, calculations, and cleaning data.

In [91]:
student = {
    "Name": ["Ali", "Ayesha", "Babar", "Zainab", "Usman", "Hina", "Ahmed", "Sara", "Hamza", "Noor"],
    "Math": [85, 78, 92, 66, 88, 74, 90, 81, 69, 95],
    "Science": [80, 82, 89, 70, 85, 76, 92, 79, 72, 94]
}

df = pd.DataFrame(student)
df

     Name  Math  Science
0     Ali    85       80
1  Ayesha    78       82
2   Babar    92       89
3  Zainab    66       70
4   Usman    88       85
5    Hina    74       76
6   Ahmed    90       92
7    Sara    81       79
8   Hamza    69       72
9    Noor    95       94

In [95]:
df["Total Marks"] = df[["Math","Science"]].apply(lambda row: row.sum(),axis=1)
df["Total Marks"]

0    165
1    160
2    181
3    136
4    173
5    150
6    182
7    160
8    141
9    189
Name: Total Marks, dtype: int64

In [97]:
col_mean = df[["Math","Science"]].apply(lambda col: col.mean())
col_mean

Math       81.8
Science    81.9
dtype: float64

In [99]:
def to_grade(s):
    if s>=90:
        return "A"
    elif s>=70:
        return "B"
    elif s>=40:
        return "C"
    else:
        return "F"
    
df["Math Grade"] = df["Math"].apply(to_grade)

In [101]:
df

     Name  Math  Science  Total Marks Math Grade
0     Ali    85       80          165          B
1  Ayesha    78       82          160          B
2   Babar    92       89          181          A
3  Zainab    66       70          136          C
4   Usman    88       85          173          B
5    Hina    74       76          150          B
6   Ahmed    90       92          182          A
7    Sara    81       79          160          B
8   Hamza    69       72          141          C
9    Noor    95       94          189          A

In [103]:
df["Name"]= df["Name"].map(str.lower)
df

     Name  Math  Science  Total Marks Math Grade
0     ali    85       80          165          B
1  ayesha    78       82          160          B
2   babar    92       89          181          A
3  zainab    66       70          136          C
4   usman    88       85          173          B
5    hina    74       76          150          B
6   ahmed    90       92          182          A
7    sara    81       79          160          B
8   hamza    69       72          141          C
9    noor    95       94          189          A

In [107]:
df["Bonus Math"] = df["Math"].map(lambda x: x+5)
df

     Name  Math  Science  Total Marks Math Grade  Bonus Math
0     ali    85       80          165          B          90
1  ayesha    78       82          160          B          83
2   babar    92       89          181          A          97
3  zainab    66       70          136          C          71
4   usman    88       85          173          B          93
5    hina    74       76          150          B          79
6   ahmed    90       92          182          A          95
7    sara    81       79          160          B          86
8   hamza    69       72          141          C          74
9    noor    95       94          189          A         100